{
    "description_html": "\n<p>Debate on public issues--and where candidates stand on them-- have traditionally represented the focal point of presidential campaigns. In recent decades, however, rather than asking where candidates stand on the issues, the public increasingly wants to know who they are. The issue of character has thus come to dominate presidential elections.</p> <p>While there is increasing public awareness that the psychology, judgment, and leadership qualities of presidential candidates count, the basis on which these judgments should made remains unclear. Does it matter that Gary Hart changed his name or had an affair? Should Ed Muskie's loss of composure while defending his wife during a campaign speech, or Thomas Eagleton's hospitalization for depression, have counted against them?</p> <p>Looking back over the past 25 years, Stanley Renshon, a political scientist and psychoanalyst, provides the first comprehensive accounting of how character has become an increasingly important issue in a presidential campaign. He traces two related but distinctive approaches to the issue of presidential character and psychology. The first concerns the mental health of our candidates and presidents. Are they emotionally and personally stable? Is their temperament suitable for the presidency? The second concerns character. Is the candidate honest? Does he possess the necessary judgment and motivation to deal with the tremendous responsibilities and pressures of the office?</p> <p>Drawing on his clinical and political science training, Renshon has devised a theory which will allow the public to better evaluate presidential candidates. Why are honesty, integrity, and personal ideals so important in judging candidates? Is personal and political ambition necessarily a bad trait? Do extra-marital affairs really matter? Finally, and most importantly, how can the public tell whether a candidate's leadership will be enhanced or impeded by aspects of his personality?<p>With this sweeping volume, Stanley Renshon has provided us with the most comprehensive account to date of how the public judges, and should judge, our future presidents.</p>",
    "identifier": "9780814774694",
    "subject": "POLITICAL SCIENCE / General",
    "title": "The Psychological Assessment of Presidential Candidates",
    "author": [
        "Stanley A Renshon"
    ]
}