{
    "description_html": "\n<p>\"[An] engrossing study, told mainly by the subjects themselves... a valuable addition to POW literature and unique for its positive view of wartime captivity.\"<BR>&#151;<I>Publishers Weekly</I></p> <p>\"Lieblich has skillfully integrated oral histories to produce a compelling story.\"<BR>&#151;<I>Library Journal</I></p> <p>\"The minutes of the meetings recorded hereby are an excerpt of the lives of ten men, who had spent all their days and nights together. Each one observed the other in his grief and joy.Each one, according to his ability and sensitivity, saw it as his duty to contribute to the general welfare, to save our boat from sinking....In fact, we managed to keep afloat most of the time, and if we erred here or there, at least we had the best intentions.\"</p>&#151;<I>From a secret collective diary kept by ten POWs</I></p> <p>A national bestseller when it first appeared in Israel, <I>Seasons of Captivity</I> is a story of human survival and hope that documents the experience of ten Israeli prisoners of war who shared a single jail cell in Egypt for more than three years.</p> <p>The engrossing chronicle of the prisoners' ordeal is told in their own words&#151;from their capture in 1969, through six months of interrogation, torture, and isolation, to their movement to a common room. A watershed event, their transfer to shared living quarters enabled them to forge a community and an almost utopian social system. They held weekly meetings, kept a common diary, started study classes, and, among other projects, translated <I>The Hobbit</I> into Hebrew.</p> <p>The narrative goes on to describe the re-entry of the POWs into family and social roles upon their release and return to Israel in 1973. An exploration of the personal impact of the experience on the wives of the married prisoners introduces the women's own stories of separation and reunion. Some of them had suddenly found themselves, in effect, single mothers&#151;yet their husbands were alive. Their husbands found stronger, more independent women in place of the traditional ones they had left behind. One of the women remarks, I thought [my husband] had been angry at me, in part unconsciously, for being so strong and competent in his absence...I had managed, well, almost effortlessly.</p> <p>This dramatic and moving account illustrates the resilience of the human spirit in the face of the most dehumanizing circumstances.</p>",
    "identifier": "9781479898626",
    "subject": "PSYCHOLOGY / Personality",
    "subtitle": "The Inner World of Pows",
    "title": "Seasons of Captivity",
    "author": [
        "Amia Lieblich"
    ]
}